{
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "book": 2,
    "booking": 3,
    "vehicle": 4,
    "car": 5,
    "ride": 6,
    "taxi": 7,
    "want": 8,
    "need": 9,
    "i": 10,
    "to": 11,
    "a": 12,
    "the": 13,
    "payment": 14,
    "pay": 15,
    "money": 16,
    "transfer": 17,
    "send": 18,
    "mpesa": 19,
    "weather": 20,
    "temperature": 21,
    "forecast": 22,
    "rain": 23,
    "sunny": 24,
    "how": 25,
    "what": 26,
    "where": 27,
    "when": 28,
    "is": 29,
    "it": 30,
    "today": 31,
    "tomorrow": 32,
    "can": 33,
    "help": 34,
    "me": 35,
    "please": 36,
    "hello": 37,
    "hi": 38,
    "good": 39,
    "morning": 40,
    "afternoon": 41,
    "evening": 42,
    "thanks": 43,
    "thank": 44,
    "you": 45,
    "price": 46,
    "cost": 47,
    "much": 48,
    "service": 49,
    "available": 50,
    "cancel": 51,
    "change": 52,
    "modify": 53,
    "pickup": 54,
    "dropoff": 55,
    "location": 56,
    "time": 57,
    "date": 58,
    "schedule": 59,
    "reservation": 60
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "book",
    "3": "booking",
    "4": "vehicle",
    "5": "car",
    "6": "ride",
    "7": "taxi",
    "8": "want",
    "9": "need",
    "10": "i",
    "11": "to",
    "12": "a",
    "13": "the",
    "14": "payment",
    "15": "pay",
    "16": "money",
    "17": "transfer",
    "18": "send",
    "19": "mpesa",
    "20": "weather",
    "21": "temperature",
    "22": "forecast",
    "23": "rain",
    "24": "sunny",
    "25": "how",
    "26": "what",
    "27": "where",
    "28": "when",
    "29": "is",
    "30": "it",
    "31": "today",
    "32": "tomorrow",
    "33": "can",
    "34": "help",
    "35": "me",
    "36": "please",
    "37": "hello",
    "38": "hi",
    "39": "good",
    "40": "morning",
    "41": "afternoon",
    "42": "evening",
    "43": "thanks",
    "44": "thank",
    "45": "you",
    "46": "price",
    "47": "cost",
    "48": "much",
    "49": "service",
    "50": "available",
    "51": "cancel",
    "52": "change",
    "53": "modify",
    "54": "pickup",
    "55": "dropoff",
    "56": "location",
    "57": "time",
    "58": "date",
    "59": "schedule",
    "60": "reservation"
  }
}